duinopeak/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cache=Cache
menu.speed=CPU Speed
menu.opt=Optimize
menu.maxqspi=Max QSPI
menu.usbstack=USB Stack
menu.debug=Debug

# Duinopeak Boneduino M0 Express (SAMD21)
# ------------------------------
duinopeak_boneduino_m0_express.name=Duinopeak Boneduino M0 Express
duinopeak_boneduino_m0_express.vid.0=0x239A
duinopeak_boneduino_m0_express.pid.0=0x801B
duinopeak_boneduino_m0_express.vid.1=0x239A
duinopeak_boneduino_m0_express.pid.1=0x001B
duinopeak_boneduino_m0_express.upload.tool=bossac
duinopeak_boneduino_m0_express.upload.protocol=sam-ba
duinopeak_boneduino_m0_express.upload.maximum_size=262144
duinopeak_boneduino_m0_express.upload.offset=0x2000
duinopeak_boneduino_m0_express.upload.use_1200bps_touch=true
duinopeak_boneduino_m0_express.upload.wait_for_upload_port=true
duinopeak_boneduino_m0_express.upload.native_usb=true
duinopeak_boneduino_m0_express.build.mcu=cortex-m0plus
duinopeak_boneduino_m0_express.build.f_cpu=48000000L
duinopeak_boneduino_m0_express.build.usb_product="Boneduino M0 Express"
duinopeak_boneduino_m0_express.build.usb_manufacturer="Duinopeak"
duinopeak_boneduino_m0_express.build.board=SAMD_BONEDUINO_M0_EXPRESS
duinopeak_boneduino_m0_express.build.core=arduino
duinopeak_boneduino_m0_express.build.extra_flags=-DARDUINO_SAMD_ZERO -DARDUINO_SAMD_BONEDUINO_M0 -DARM_MATH_CM0PLUS -DDUINOPEAK_BONEDUINO_M0_EXPRESS -D__SAMD21G18A__ {build.usb_flags}
duinopeak_boneduino_m0_express.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
duinopeak_boneduino_m0_express.build.openocdscript=openocd_scripts/boneduino_m0_express.cfg
duinopeak_boneduino_m0_express.build.variant=boneduino_m0_express
duinopeak_boneduino_m0_express.build.variant_system_lib=
duinopeak_boneduino_m0_express.build.vid=0x239A
duinopeak_boneduino_m0_express.build.pid=0x801B
duinopeak_boneduino_m0_express.bootloader.tool=openocd
duinopeak_boneduino_m0_express.bootloader.file=boneduino_m0_express/bootloader-boneduino_m0_express-3.11.0-18-g5301af7-dirty.bin
duinopeak_boneduino_m0_express.menu.opt.small=Small (-Os) (standard)
duinopeak_boneduino_m0_express.menu.opt.small.build.flags.optimize=-Os
duinopeak_boneduino_m0_express.menu.opt.fast=Fast (-O2)
duinopeak_boneduino_m0_express.menu.opt.fast.build.flags.optimize=-O2
duinopeak_boneduino_m0_express.menu.opt.faster=Faster (-O3)
duinopeak_boneduino_m0_express.menu.opt.faster.build.flags.optimize=-O3
duinopeak_boneduino_m0_express.menu.opt.fastest=Fastest (-Ofast)
duinopeak_boneduino_m0_express.menu.opt.fastest.build.flags.optimize=-Ofast
duinopeak_boneduino_m0_express.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
duinopeak_boneduino_m0_express.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
duinopeak_boneduino_m0_express.menu.usbstack.arduino=Arduino
duinopeak_boneduino_m0_express.menu.usbstack.tinyusb=TinyUSB
duinopeak_boneduino_m0_express.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
duinopeak_boneduino_m0_express.menu.debug.off=Off
duinopeak_boneduino_m0_express.menu.debug.on=On
duinopeak_boneduino_m0_express.menu.debug.on.build.flags.debug=-g


#duinopeak_radio_m0.name=Duinopeak M0 Radio (Native USB Port)
#duinopeak_radio_m0.vid.0=0x239A
#duinopeak_radio_m0.pid.0=0x8014
#duinopeak_radio_m0.vid.1=0x239A
#duinopeak_radio_m0.pid.1=0x0014
#duinopeak_radio_m0.upload.tool=bossac
#duinopeak_radio_m0.upload.protocol=sam-ba
#duinopeak_radio_m0.upload.maximum_size=262144
#duinopeak_radio_m0.upload.use_1200bps_touch=true
#duinopeak_radio_m0.upload.wait_for_upload_port=true
#duinopeak_radio_m0.upload.native_usb=true
#duinopeak_radio_m0.build.mcu=cortex-m0plus
#duinopeak_radio_m0.build.f_cpu=48000000L
#duinopeak_radio_m0.build.usb_product="Radio M0"
#duinopeak_radio_m0.build.usb_manufacturer="Duinopeak"
#duinopeak_radio_m0.build.board=SAMD_ZERO
#duinopeak_radio_m0.build.core=arduino
#duinopeak_radio_m0.build.extra_flags=-D__SAMR21G18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
#duinopeak_radio_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
#duinopeak_radio_m0.build.openocdscript=openocd_scripts/zero_radio.cfg
#duinopeak_radio_m0.build.variant=zero_radio
#duinopeak_radio_m0.build.variant_system_lib=
#duinopeak_radio_m0.build.vid=0x239A
#duinopeak_radio_m0.build.pid=0x8014
#duinopeak_radio_m0.bootloader.tool=openocd
#duinopeak_radio_m0.bootloader.file=boneduino/samr21_sam_ba.bin

# Duinopeak Metro M0 Express (SAMD21)
# ------------------------------
duinopeak_metro_m0.name=Duinopeak Metro M0 Express
duinopeak_metro_m0.vid.0=0x239A
duinopeak_metro_m0.pid.0=0x8013
duinopeak_metro_m0.vid.1=0x239A
duinopeak_metro_m0.pid.1=0x0013
duinopeak_metro_m0.upload.tool=bossac
duinopeak_metro_m0.upload.protocol=sam-ba
duinopeak_metro_m0.upload.maximum_size=262144
duinopeak_metro_m0.upload.offset=0x2000
duinopeak_metro_m0.upload.use_1200bps_touch=true
duinopeak_metro_m0.upload.wait_for_upload_port=true
duinopeak_metro_m0.upload.native_usb=true
duinopeak_metro_m0.build.mcu=cortex-m0plus
duinopeak_metro_m0.build.f_cpu=48000000L
duinopeak_metro_m0.build.usb_product="Metro M0 Express"
duinopeak_metro_m0.build.usb_manufacturer="Duinopeak"
duinopeak_metro_m0.build.board=SAMD_ZERO
duinopeak_metro_m0.build.core=arduino
duinopeak_metro_m0.build.extra_flags=-D__SAMD21G18A__ -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS -DDUINOPEAK_METRO_M0_EXPRESS {build.usb_flags}
duinopeak_metro_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
duinopeak_metro_m0.build.openocdscript=openocd_scripts/metro_m0.cfg
duinopeak_metro_m0.build.variant=metro_m0
duinopeak_metro_m0.build.variant_system_lib=
duinopeak_metro_m0.build.vid=0x239A
duinopeak_metro_m0.build.pid=0x8013
duinopeak_metro_m0.bootloader.tool=openocd
duinopeak_metro_m0.bootloader.file=metroM0/bootloader-metro_m0-v2.0.0-duinopeak.5.bin
duinopeak_metro_m0.menu.opt.small=Small (-Os) (standard)
duinopeak_metro_m0.menu.opt.small.build.flags.optimize=-Os
duinopeak_metro_m0.menu.opt.fast=Fast (-O2)
duinopeak_metro_m0.menu.opt.fast.build.flags.optimize=-O2
duinopeak_metro_m0.menu.opt.faster=Faster (-O3)
duinopeak_metro_m0.menu.opt.faster.build.flags.optimize=-O3
duinopeak_metro_m0.menu.opt.fastest=Fastest (-Ofast)
duinopeak_metro_m0.menu.opt.fastest.build.flags.optimize=-Ofast
duinopeak_metro_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
duinopeak_metro_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
duinopeak_metro_m0.menu.usbstack.arduino=Arduino
duinopeak_metro_m0.menu.usbstack.tinyusb=TinyUSB
duinopeak_metro_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
duinopeak_metro_m0.menu.debug.off=Off
duinopeak_metro_m0.menu.debug.on=On
duinopeak_metro_m0.menu.debug.on.build.flags.debug=-g


# Duinopeak Pywearable Express (SAMD21)
# ------------------------------
duinopeak_circuitplayground_m0.name=Duinopeak Pywearable Express
duinopeak_circuitplayground_m0.vid.0=0x239A
duinopeak_circuitplayground_m0.pid.0=0x8018
duinopeak_circuitplayground_m0.vid.1=0x239A
duinopeak_circuitplayground_m0.pid.1=0x0019
duinopeak_circuitplayground_m0.upload.tool=bossac
duinopeak_circuitplayground_m0.upload.protocol=sam-ba
duinopeak_circuitplayground_m0.upload.maximum_size=262144
duinopeak_circuitplayground_m0.upload.offset=0x2000
duinopeak_circuitplayground_m0.upload.use_1200bps_touch=true
duinopeak_circuitplayground_m0.upload.wait_for_upload_port=true
duinopeak_circuitplayground_m0.upload.native_usb=true
duinopeak_circuitplayground_m0.build.mcu=cortex-m0plus
duinopeak_circuitplayground_m0.build.f_cpu=48000000L
duinopeak_circuitplayground_m0.build.usb_product="Pywearable Express"
duinopeak_circuitplayground_m0.build.usb_manufacturer="Duinopeak"
duinopeak_circuitplayground_m0.build.board=SAMD_CIRCUITPLAYGROUND_EXPRESS
duinopeak_circuitplayground_m0.build.core=arduino
duinopeak_circuitplayground_m0.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -D__SAMD21G18A__ -DARM_MATH_CM0PLUS -DDUINOPEAK_CIRCUITPLAYGROUND_M0 {build.usb_flags}
duinopeak_circuitplayground_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
duinopeak_circuitplayground_m0.build.openocdscript=openocd_scripts/circuit_play.cfg
duinopeak_circuitplayground_m0.build.variant=pywearable
duinopeak_circuitplayground_m0.build.variant_system_lib=
duinopeak_circuitplayground_m0.build.vid=0x239A
duinopeak_circuitplayground_m0.build.pid=0x8018
duinopeak_circuitplayground_m0.bootloader.tool=openocd
duinopeak_circuitplayground_m0.bootloader.file=boneduino_pywearable/bootloader-boneduino_pywearable-3.11.0-18-g5301af7-dirty.bin
duinopeak_circuitplayground_m0.menu.opt.small=Small (-Os) (standard)
duinopeak_circuitplayground_m0.menu.opt.small.build.flags.optimize=-Os
duinopeak_circuitplayground_m0.menu.opt.fast=Fast (-O2)
duinopeak_circuitplayground_m0.menu.opt.fast.build.flags.optimize=-O2
duinopeak_circuitplayground_m0.menu.opt.faster=Faster (-O3)
duinopeak_circuitplayground_m0.menu.opt.faster.build.flags.optimize=-O3
duinopeak_circuitplayground_m0.menu.opt.fastest=Fastest (-Ofast)
duinopeak_circuitplayground_m0.menu.opt.fastest.build.flags.optimize=-Ofast
duinopeak_circuitplayground_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
duinopeak_circuitplayground_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
duinopeak_circuitplayground_m0.menu.usbstack.arduino=Arduino
duinopeak_circuitplayground_m0.menu.usbstack.tinyusb=TinyUSB
duinopeak_circuitplayground_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
duinopeak_circuitplayground_m0.menu.debug.off=Off
duinopeak_circuitplayground_m0.menu.debug.on=On
duinopeak_circuitplayground_m0.menu.debug.on.build.flags.debug=-g

# Duinopeak HalloWing M0 (SAMD21)
# ------------------------------
duinopeak_hallowing.name=Duinopeak Hallowing M0
duinopeak_hallowing.vid.0=0x239A
duinopeak_hallowing.pid.0=0xDEAD
duinopeak_hallowing.vid.1=0x239A
duinopeak_hallowing.pid.1=0xD1ED
duinopeak_hallowing.vid.1=0x239A
duinopeak_hallowing.pid.1=0xB000
duinopeak_hallowing.upload.tool=bossac
duinopeak_hallowing.upload.protocol=sam-ba
duinopeak_hallowing.upload.maximum_size=262144
duinopeak_hallowing.upload.offset=0x2000
duinopeak_hallowing.upload.use_1200bps_touch=true
duinopeak_hallowing.upload.wait_for_upload_port=true
duinopeak_hallowing.upload.native_usb=true
duinopeak_hallowing.build.mcu=cortex-m0plus
duinopeak_hallowing.build.f_cpu=48000000L
duinopeak_hallowing.build.usb_product="Hallowing M0"
duinopeak_hallowing.build.usb_manufacturer="Duinopeak"
duinopeak_hallowing.build.board=SAMD_HALLOWING
duinopeak_hallowing.build.core=arduino
duinopeak_hallowing.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -DARDUINO_SAMD_HALLOWING_M0 -DARM_MATH_CM0PLUS -DDUINOPEAK_HALLOWING -D__SAMD21G18A__ {build.usb_flags}
duinopeak_hallowing.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
duinopeak_hallowing.build.openocdscript=openocd_scripts/hallowing_m0_express.cfg
duinopeak_hallowing.build.variant=hallowing_m0_express
duinopeak_hallowing.build.variant_system_lib=
duinopeak_hallowing.build.vid=0x239A
duinopeak_hallowing.build.pid=0xDEAD
duinopeak_hallowing.bootloader.tool=openocd
duinopeak_hallowing.bootloader.file=hallowingM0/bootloader-hallowing_m0-v2.0.0-duinopeak.0-21-g887cc30.bin
duinopeak_hallowing.menu.opt.small=Small (-Os) (standard)
duinopeak_hallowing.menu.opt.small.build.flags.optimize=-Os
duinopeak_hallowing.menu.opt.fast=Fast (-O2)
duinopeak_hallowing.menu.opt.fast.build.flags.optimize=-O2
duinopeak_hallowing.menu.opt.faster=Faster (-O3)
duinopeak_hallowing.menu.opt.faster.build.flags.optimize=-O3
duinopeak_hallowing.menu.opt.fastest=Fastest (-Ofast)
duinopeak_hallowing.menu.opt.fastest.build.flags.optimize=-Ofast
duinopeak_hallowing.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
duinopeak_hallowing.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
duinopeak_hallowing.menu.usbstack.arduino=Arduino
duinopeak_hallowing.menu.usbstack.tinyusb=TinyUSB
duinopeak_hallowing.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
duinopeak_hallowing.menu.debug.off=Off
duinopeak_hallowing.menu.debug.on=On
duinopeak_hallowing.menu.debug.on.build.flags.debug=-g

