duinopeak/ArduinoCore-samd/boards.txt
# Duinopeak Metro M4 (SAMD51)
# ------------------------------
duinopeak_metro_m4.name=Duinopeak Metro M4 (SAMD51)
duinopeak_metro_m4.vid.0=0x239A
duinopeak_metro_m4.pid.0=0x8020
duinopeak_metro_m4.vid.1=0x239A
duinopeak_metro_m4.pid.1=0x0020
duinopeak_metro_m4.upload.tool=bossac18
duinopeak_metro_m4.upload.protocol=sam-ba
duinopeak_metro_m4.upload.maximum_size=507904
duinopeak_metro_m4.upload.offset=0x4000
duinopeak_metro_m4.upload.use_1200bps_touch=true
duinopeak_metro_m4.upload.wait_for_upload_port=true
duinopeak_metro_m4.upload.native_usb=true
duinopeak_metro_m4.build.mcu=cortex-m4
#duinopeak_metro_m4.build.f_cpu=120000000L
duinopeak_metro_m4.build.usb_product="Duinopeak Metro M4"
duinopeak_metro_m4.build.usb_manufacturer="Duinopeak LLC"
duinopeak_metro_m4.build.board=METRO_M4
duinopeak_metro_m4.build.core=arduino
duinopeak_metro_m4.build.extra_flags=-D__SAMD51J19A__ -DDUINOPEAK_METRO_M4_EXPRESS -D__SAMD51__ {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
duinopeak_metro_m4.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
duinopeak_metro_m4.build.openocdscript=openocd_scripts/arduino_zero.cfg
duinopeak_metro_m4.build.variant=metro_m4
duinopeak_metro_m4.build.variant_system_lib=
duinopeak_metro_m4.build.vid=0x239A
duinopeak_metro_m4.build.pid=0x8020
duinopeak_metro_m4.bootloader.tool=openocd
duinopeak_metro_m4.bootloader.file=metroM4/bootloader-metro_m4-v2.0.0-duinopeak.5.bin
duinopeak_metro_m4.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16
duinopeak_metro_m4.menu.cache.on=Enabled
duinopeak_metro_m4.menu.cache.on.build.cache_flags=-DENABLE_CACHE
duinopeak_metro_m4.menu.cache.off=Disabled
duinopeak_metro_m4.menu.cache.off.build.cache_flags=
duinopeak_metro_m4.menu.speed.120=120 MHz (standard)
duinopeak_metro_m4.menu.speed.120.build.f_cpu=120000000L
duinopeak_metro_m4.menu.speed.150=150 MHz (overclock)
duinopeak_metro_m4.menu.speed.150.build.f_cpu=150000000L
duinopeak_metro_m4.menu.speed.180=180 MHz (overclock)
duinopeak_metro_m4.menu.speed.180.build.f_cpu=180000000L
duinopeak_metro_m4.menu.speed.200=200 MHz (overclock)
duinopeak_metro_m4.menu.speed.200.build.f_cpu=200000000L
duinopeak_metro_m4.menu.opt.small=Small (-Os) (standard)
duinopeak_metro_m4.menu.opt.small.build.flags.optimize=-Os
duinopeak_metro_m4.menu.opt.fast=Fast (-O2)
duinopeak_metro_m4.menu.opt.fast.build.flags.optimize=-O2
duinopeak_metro_m4.menu.opt.faster=Faster (-O3)
duinopeak_metro_m4.menu.opt.faster.build.flags.optimize=-O3
duinopeak_metro_m4.menu.opt.fastest=Fastest (-Ofast)
duinopeak_metro_m4.menu.opt.fastest.build.flags.optimize=-Ofast
duinopeak_metro_m4.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
duinopeak_metro_m4.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
duinopeak_metro_m4.menu.maxqspi.50=50 MHz (standard)
duinopeak_metro_m4.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
duinopeak_metro_m4.menu.maxqspi.fcpu=CPU Speed / 2
duinopeak_metro_m4.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
duinopeak_metro_m4.menu.usbstack.arduino=Arduino
duinopeak_metro_m4.menu.usbstack.tinyusb=TinyUSB
duinopeak_metro_m4.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
duinopeak_metro_m4.menu.debug.off=Off
duinopeak_metro_m4.menu.debug.on=On
duinopeak_metro_m4.menu.debug.on.build.flags.debug=-g


# Duinopeak Grand Central M4 (SAMD51)
# ------------------------------
duinopeak_grandcentral_m4.name=Duinopeak Grand Central M4 (SAMD51)
duinopeak_grandcentral_m4.vid.0=0x239A
duinopeak_grandcentral_m4.pid.0=0x8031
duinopeak_grandcentral_m4.vid.1=0x239A
duinopeak_grandcentral_m4.pid.1=0x0031
duinopeak_grandcentral_m4.vid.1=0x239A
duinopeak_grandcentral_m4.pid.1=0x0032
duinopeak_grandcentral_m4.upload.tool=bossac18
duinopeak_grandcentral_m4.upload.protocol=sam-ba
duinopeak_grandcentral_m4.upload.maximum_size=1032192
duinopeak_grandcentral_m4.upload.offset=0x4000
duinopeak_grandcentral_m4.upload.use_1200bps_touch=true
duinopeak_grandcentral_m4.upload.wait_for_upload_port=true
duinopeak_grandcentral_m4.upload.native_usb=true
duinopeak_grandcentral_m4.build.mcu=cortex-m4
#duinopeak_grandcentral_m4.build.f_cpu=120000000L
duinopeak_grandcentral_m4.build.usb_product="Duinopeak Grand Central M4"
duinopeak_grandcentral_m4.build.usb_manufacturer="Duinopeak LLC"
duinopeak_grandcentral_m4.build.board=GRAND_CENTRAL_M4
duinopeak_grandcentral_m4.build.core=arduino
duinopeak_grandcentral_m4.build.extra_flags=-D__SAMD51P20A__ -DDUINOPEAK_GRAND_CENTRAL_M4 -D__SAMD51__ {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
duinopeak_grandcentral_m4.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
duinopeak_grandcentral_m4.build.openocdscript=openocd_scripts/arduino_zero.cfg
duinopeak_grandcentral_m4.build.variant=grand_central_m4
duinopeak_grandcentral_m4.build.variant_system_lib=
duinopeak_grandcentral_m4.build.vid=0x239A
duinopeak_grandcentral_m4.build.pid=0x8031
duinopeak_grandcentral_m4.bootloader.tool=openocd
duinopeak_grandcentral_m4.bootloader.file=grand_central_m4/bootloader-grandcentral_m4.bin
duinopeak_grandcentral_m4.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16
duinopeak_grandcentral_m4.menu.cache.on=Enabled
duinopeak_grandcentral_m4.menu.cache.on.build.cache_flags=-DENABLE_CACHE
duinopeak_grandcentral_m4.menu.cache.off=Disabled
duinopeak_grandcentral_m4.menu.cache.off.build.cache_flags=
duinopeak_grandcentral_m4.menu.speed.120=120 MHz (standard)
duinopeak_grandcentral_m4.menu.speed.120.build.f_cpu=120000000L
duinopeak_grandcentral_m4.menu.speed.150=150 MHz (overclock)
duinopeak_grandcentral_m4.menu.speed.150.build.f_cpu=150000000L
duinopeak_grandcentral_m4.menu.speed.180=180 MHz (overclock)
duinopeak_grandcentral_m4.menu.speed.180.build.f_cpu=180000000L
duinopeak_grandcentral_m4.menu.speed.200=200 MHz (overclock)
duinopeak_grandcentral_m4.menu.speed.200.build.f_cpu=200000000L
duinopeak_grandcentral_m4.menu.opt.small=Small (-Os) (standard)
duinopeak_grandcentral_m4.menu.opt.small.build.flags.optimize=-Os
duinopeak_grandcentral_m4.menu.opt.fast=Fast (-O2)
duinopeak_grandcentral_m4.menu.opt.fast.build.flags.optimize=-O2
duinopeak_grandcentral_m4.menu.opt.faster=Faster (-O3)
duinopeak_grandcentral_m4.menu.opt.faster.build.flags.optimize=-O3
duinopeak_grandcentral_m4.menu.opt.fastest=Fastest (-Ofast)
duinopeak_grandcentral_m4.menu.opt.fastest.build.flags.optimize=-Ofast
duinopeak_grandcentral_m4.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
duinopeak_grandcentral_m4.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
duinopeak_grandcentral_m4.menu.maxqspi.50=50 MHz (standard)
duinopeak_grandcentral_m4.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
duinopeak_grandcentral_m4.menu.maxqspi.fcpu=CPU Speed / 2
duinopeak_grandcentral_m4.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
duinopeak_grandcentral_m4.menu.usbstack.arduino=Arduino
duinopeak_grandcentral_m4.menu.usbstack.tinyusb=TinyUSB
duinopeak_grandcentral_m4.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
duinopeak_grandcentral_m4.menu.debug.off=Off
duinopeak_grandcentral_m4.menu.debug.on=On
duinopeak_grandcentral_m4.menu.debug.on.build.flags.debug=-g

# Duinopeak Boneduino M4 Express (SAMD51)
# ------------------------------
duinopeak_boneduino_m4.name=Duinopeak Boneduino M4 Express (SAMD51)
duinopeak_boneduino_m4.vid.0=0x239A
duinopeak_boneduino_m4.pid.0=0x8022
duinopeak_boneduino_m4.vid.1=0x239A
duinopeak_boneduino_m4.pid.1=0x0022
duinopeak_boneduino_m4.upload.tool=bossac18
duinopeak_boneduino_m4.upload.protocol=sam-ba
duinopeak_boneduino_m4.upload.maximum_size=507904
duinopeak_boneduino_m4.upload.offset=0x4000
duinopeak_boneduino_m4.upload.use_1200bps_touch=true
duinopeak_boneduino_m4.upload.wait_for_upload_port=true
duinopeak_boneduino_m4.upload.native_usb=true
duinopeak_boneduino_m4.build.mcu=cortex-m4
#duinopeak_boneduino_m4.build.f_cpu=120000000L
duinopeak_boneduino_m4.build.usb_product="Duinopeak Boneduino M4"
duinopeak_boneduino_m4.build.usb_manufacturer="Duinopeak LLC"
duinopeak_boneduino_m4.build.board=BONEDUINO_M4
duinopeak_boneduino_m4.build.core=arduino
duinopeak_boneduino_m4.build.extra_flags=-D__SAMD51J19A__ -DDUINOPEAK_BONEDUINO_M4_EXPRESS -D__SAMD51__ {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
duinopeak_boneduino_m4.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
duinopeak_boneduino_m4.build.openocdscript=openocd_scripts/arduino_zero.cfg
duinopeak_boneduino_m4.build.variant=boneduino_m4
duinopeak_boneduino_m4.build.variant_system_lib=
duinopeak_boneduino_m4.build.vid=0x239A
duinopeak_boneduino_m4.build.pid=0x8022
duinopeak_boneduino_m4.bootloader.tool=openocd
duinopeak_boneduino_m4.bootloader.file=boneduinoM4/bootloader-boneduino_m4_express-3.11.0-18-g5301af7-dirty.bin
duinopeak_boneduino_m4.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16 
duinopeak_boneduino_m4.menu.cache.on=Enabled
duinopeak_boneduino_m4.menu.cache.on.build.cache_flags=-DENABLE_CACHE
duinopeak_boneduino_m4.menu.cache.off=Disabled
duinopeak_boneduino_m4.menu.cache.off.build.cache_flags=
duinopeak_boneduino_m4.menu.speed.120=120 MHz (standard)
duinopeak_boneduino_m4.menu.speed.120.build.f_cpu=120000000L
duinopeak_boneduino_m4.menu.speed.150=150 MHz (overclock)
duinopeak_boneduino_m4.menu.speed.150.build.f_cpu=150000000L
duinopeak_boneduino_m4.menu.speed.180=180 MHz (overclock)
duinopeak_boneduino_m4.menu.speed.180.build.f_cpu=180000000L
duinopeak_boneduino_m4.menu.speed.200=200 MHz (overclock)
duinopeak_boneduino_m4.menu.speed.200.build.f_cpu=200000000L
duinopeak_boneduino_m4.menu.opt.small=Small (-Os) (standard)
duinopeak_boneduino_m4.menu.opt.small.build.flags.optimize=-Os
duinopeak_boneduino_m4.menu.opt.fast=Fast (-O2)
duinopeak_boneduino_m4.menu.opt.fast.build.flags.optimize=-O2
duinopeak_boneduino_m4.menu.opt.faster=Faster (-O3)
duinopeak_boneduino_m4.menu.opt.faster.build.flags.optimize=-O3
duinopeak_boneduino_m4.menu.opt.fastest=Fastest (-Ofast)
duinopeak_boneduino_m4.menu.opt.fastest.build.flags.optimize=-Ofast
duinopeak_boneduino_m4.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
duinopeak_boneduino_m4.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
duinopeak_boneduino_m4.menu.maxqspi.50=50 MHz (standard)
duinopeak_boneduino_m4.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
duinopeak_boneduino_m4.menu.maxqspi.fcpu=CPU Speed / 2
duinopeak_boneduino_m4.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
duinopeak_boneduino_m4.menu.usbstack.arduino=Arduino
duinopeak_boneduino_m4.menu.usbstack.tinyusb=TinyUSB
duinopeak_boneduino_m4.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
duinopeak_boneduino_m4.menu.debug.off=Off
duinopeak_boneduino_m4.menu.debug.on=On
duinopeak_boneduino_m4.menu.debug.on.build.flags.debug=-g

