duinopeak/ArduinoCore-samd/boards.txt
# Duinopeak Boneduino M4 CAN (SAME51)
# ------------------------------
duinopeak_boneduino_m4_can.name=Duinopeak Boneduino M4 CAN (SAME51)
duinopeak_boneduino_m4_can.vid.0=0x239A
duinopeak_boneduino_m4_can.pid.0=0x80CD
duinopeak_boneduino_m4_can.vid.1=0x239A
duinopeak_boneduino_m4_can.pid.1=0x00CD
duinopeak_boneduino_m4_can.upload.tool=bossac18
duinopeak_boneduino_m4_can.upload.protocol=sam-ba
duinopeak_boneduino_m4_can.upload.maximum_size=507904
duinopeak_boneduino_m4_can.upload.offset=0x4000
duinopeak_boneduino_m4_can.upload.use_1200bps_touch=true
duinopeak_boneduino_m4_can.upload.wait_for_upload_port=true
duinopeak_boneduino_m4_can.upload.native_usb=true
duinopeak_boneduino_m4_can.build.mcu=cortex-m4
#duinopeak_boneduino_m4_can.build.f_cpu=120000000L
duinopeak_boneduino_m4_can.build.usb_product="Duinopeak Boneduino M4 CAN"
duinopeak_boneduino_m4_can.build.usb_manufacturer="Duinopeak LLC"
duinopeak_boneduino_m4_can.build.board=BONEDUINO_M4_CAN
duinopeak_boneduino_m4_can.build.core=arduino
duinopeak_boneduino_m4_can.build.extra_flags=-D__SAME51J19A__ -DDUINOPEAK_BONEDUINO_M4_EXPRESS -DDUINOPEAK_BONEDUINO_M4_CAN -D__SAMD51__ {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
duinopeak_boneduino_m4_can.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
duinopeak_boneduino_m4_can.build.openocdscript=openocd_scripts/arduino_zero.cfg
duinopeak_boneduino_m4_can.build.variant=boneduino_m4_can
duinopeak_boneduino_m4_can.build.variant_system_lib=
duinopeak_boneduino_m4_can.build.vid=0x239A
duinopeak_boneduino_m4_can.build.pid=0x80CD
duinopeak_boneduino_m4_can.bootloader.tool=openocd
duinopeak_boneduino_m4_can.bootloader.file=boneduinoM4/bootloader-boneduino_m4_express-v2.0.0-duinopeak.5.bin
duinopeak_boneduino_m4_can.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16
duinopeak_boneduino_m4_can.menu.cache.on=Enabled
duinopeak_boneduino_m4_can.menu.cache.on.build.cache_flags=-DENABLE_CACHE
duinopeak_boneduino_m4_can.menu.cache.off=Disabled
duinopeak_boneduino_m4_can.menu.cache.off.build.cache_flags=
duinopeak_boneduino_m4_can.menu.speed.120=120 MHz (standard)
duinopeak_boneduino_m4_can.menu.speed.120.build.f_cpu=120000000L
duinopeak_boneduino_m4_can.menu.speed.150=150 MHz (overclock)
duinopeak_boneduino_m4_can.menu.speed.150.build.f_cpu=150000000L
duinopeak_boneduino_m4_can.menu.speed.180=180 MHz (overclock)
duinopeak_boneduino_m4_can.menu.speed.180.build.f_cpu=180000000L
duinopeak_boneduino_m4_can.menu.speed.200=200 MHz (overclock)
duinopeak_boneduino_m4_can.menu.speed.200.build.f_cpu=200000000L
duinopeak_boneduino_m4_can.menu.opt.small=Small (-Os) (standard)
duinopeak_boneduino_m4_can.menu.opt.small.build.flags.optimize=-Os
duinopeak_boneduino_m4_can.menu.opt.fast=Fast (-O2)
duinopeak_boneduino_m4_can.menu.opt.fast.build.flags.optimize=-O2
duinopeak_boneduino_m4_can.menu.opt.faster=Faster (-O3)
duinopeak_boneduino_m4_can.menu.opt.faster.build.flags.optimize=-O3
duinopeak_boneduino_m4_can.menu.opt.fastest=Fastest (-Ofast)
duinopeak_boneduino_m4_can.menu.opt.fastest.build.flags.optimize=-Ofast
duinopeak_boneduino_m4_can.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
duinopeak_boneduino_m4_can.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
duinopeak_boneduino_m4_can.menu.maxqspi.50=50 MHz (standard)
duinopeak_boneduino_m4_can.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
duinopeak_boneduino_m4_can.menu.maxqspi.fcpu=CPU Speed / 2
duinopeak_boneduino_m4_can.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
duinopeak_boneduino_m4_can.menu.usbstack.arduino=Arduino
duinopeak_boneduino_m4_can.menu.usbstack.tinyusb=TinyUSB
duinopeak_boneduino_m4_can.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
duinopeak_boneduino_m4_can.menu.debug.off=Off
duinopeak_boneduino_m4_can.menu.debug.on=On
duinopeak_boneduino_m4_can.menu.debug.on.build.flags.debug=-g


# Duinopeak Trellis M4 (SAMD51)
# ------------------------------
duinopeak_trellis_m4.name=Duinopeak Trellis M4 (SAMD51)
duinopeak_trellis_m4.vid.0=0x239A
duinopeak_trellis_m4.pid.0=0x802F
duinopeak_trellis_m4.vid.1=0x239A
duinopeak_trellis_m4.pid.1=0x002F
duinopeak_trellis_m4.vid.2=0x239A
duinopeak_trellis_m4.pid.2=0x0030
duinopeak_trellis_m4.upload.tool=bossac18
duinopeak_trellis_m4.upload.protocol=sam-ba
duinopeak_trellis_m4.upload.maximum_size=507904
duinopeak_trellis_m4.upload.offset=0x4000
duinopeak_trellis_m4.upload.use_1200bps_touch=true
duinopeak_trellis_m4.upload.wait_for_upload_port=true
duinopeak_trellis_m4.upload.native_usb=true
duinopeak_trellis_m4.build.mcu=cortex-m4
#duinopeak_trellis_m4.build.f_cpu=120000000L
duinopeak_trellis_m4.build.usb_product="Duinopeak Trellis M4"
duinopeak_trellis_m4.build.usb_manufacturer="Duinopeak LLC"
duinopeak_trellis_m4.build.board=TRELLIS_M4
duinopeak_trellis_m4.build.core=arduino
duinopeak_trellis_m4.build.extra_flags=-D__SAMD51G19A__ -DDUINOPEAK_TRELLIS_M4_EXPRESS -D__SAMD51__ {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -DCRYSTALLESS -mfloat-abi=hard -mfpu=fpv4-sp-d16
duinopeak_trellis_m4.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
duinopeak_trellis_m4.build.openocdscript=openocd_scripts/arduino_zero.cfg
duinopeak_trellis_m4.build.variant=trellis_m4
duinopeak_trellis_m4.build.variant_system_lib=
duinopeak_trellis_m4.build.vid=0x239A
duinopeak_trellis_m4.build.pid=0x802F
duinopeak_trellis_m4.bootloader.tool=openocd
duinopeak_trellis_m4.bootloader.file=trellisM4/bootloader-trellis_m4-v2.0.0-duinopeak.5.bin
duinopeak_trellis_m4.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16
duinopeak_trellis_m4.menu.cache.on=Enabled
duinopeak_trellis_m4.menu.cache.on.build.cache_flags=-DENABLE_CACHE
duinopeak_trellis_m4.menu.cache.off=Disabled
duinopeak_trellis_m4.menu.cache.off.build.cache_flags=
duinopeak_trellis_m4.menu.speed.120=120 MHz (standard)
duinopeak_trellis_m4.menu.speed.120.build.f_cpu=120000000L
duinopeak_trellis_m4.menu.speed.150=150 MHz (overclock)
duinopeak_trellis_m4.menu.speed.150.build.f_cpu=150000000L
duinopeak_trellis_m4.menu.speed.180=180 MHz (overclock)
duinopeak_trellis_m4.menu.speed.180.build.f_cpu=180000000L
duinopeak_trellis_m4.menu.speed.200=200 MHz (overclock)
duinopeak_trellis_m4.menu.speed.200.build.f_cpu=200000000L
duinopeak_trellis_m4.menu.opt.small=Small (-Os) (standard)
duinopeak_trellis_m4.menu.opt.small.build.flags.optimize=-Os
duinopeak_trellis_m4.menu.opt.fast=Fast (-O2)
duinopeak_trellis_m4.menu.opt.fast.build.flags.optimize=-O2
duinopeak_trellis_m4.menu.opt.faster=Faster (-O3)
duinopeak_trellis_m4.menu.opt.faster.build.flags.optimize=-O3
duinopeak_trellis_m4.menu.opt.fastest=Fastest (-Ofast)
duinopeak_trellis_m4.menu.opt.fastest.build.flags.optimize=-Ofast
duinopeak_trellis_m4.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
duinopeak_trellis_m4.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
duinopeak_trellis_m4.menu.maxqspi.50=50 MHz (standard)
duinopeak_trellis_m4.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
duinopeak_trellis_m4.menu.maxqspi.fcpu=CPU Speed / 2
duinopeak_trellis_m4.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
duinopeak_trellis_m4.menu.usbstack.arduino=Arduino
duinopeak_trellis_m4.menu.usbstack.tinyusb=TinyUSB
duinopeak_trellis_m4.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
duinopeak_trellis_m4.menu.debug.off=Off
duinopeak_trellis_m4.menu.debug.on=On
duinopeak_trellis_m4.menu.debug.on.build.flags.debug=-g

# Duinopeak PyPortal M4 (SAMD51)
# ------------------------------
duinopeak_pyportal_m4.name=Duinopeak PyPortal M4 (SAMD51)
duinopeak_pyportal_m4.vid.0=0x239A
duinopeak_pyportal_m4.pid.0=0x8035
duinopeak_pyportal_m4.vid.1=0x239A
duinopeak_pyportal_m4.pid.1=0x0035
duinopeak_pyportal_m4.upload.tool=bossac18
duinopeak_pyportal_m4.upload.protocol=sam-ba
duinopeak_pyportal_m4.upload.maximum_size=1032192
duinopeak_pyportal_m4.upload.offset=0x4000
duinopeak_pyportal_m4.upload.use_1200bps_touch=true
duinopeak_pyportal_m4.upload.wait_for_upload_port=true
duinopeak_pyportal_m4.upload.native_usb=true
duinopeak_pyportal_m4.build.mcu=cortex-m4
#duinopeak_pyportal_m4.build.f_cpu=120000000L
duinopeak_pyportal_m4.build.usb_product="Duinopeak PyPortal M4"
duinopeak_pyportal_m4.build.usb_manufacturer="Duinopeak LLC"
duinopeak_pyportal_m4.build.board=PYPORTAL_M4
duinopeak_pyportal_m4.build.core=arduino
duinopeak_pyportal_m4.build.extra_flags=-D__SAMD51J20A__ -DDUINOPEAK_PYPORTAL -DCRYSTALLESS -D__SAMD51__ {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
duinopeak_pyportal_m4.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
duinopeak_pyportal_m4.build.openocdscript=openocd_scripts/arduino_zero.cfg
duinopeak_pyportal_m4.build.variant=pyportal_m4
duinopeak_pyportal_m4.build.variant_system_lib=
duinopeak_pyportal_m4.build.vid=0x239A
duinopeak_pyportal_m4.build.pid=0x8035
duinopeak_pyportal_m4.bootloader.tool=openocd
duinopeak_pyportal_m4.bootloader.file=boneduino_pyportal_m4/bootloader-boneduino_pyportal_m4-3.11.0-18-g5301af7-dirty.bin
duinopeak_pyportal_m4.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16
duinopeak_pyportal_m4.menu.cache.on=Enabled
duinopeak_pyportal_m4.menu.cache.on.build.cache_flags=-DENABLE_CACHE
duinopeak_pyportal_m4.menu.cache.off=Disabled
duinopeak_pyportal_m4.menu.cache.off.build.cache_flags=
duinopeak_pyportal_m4.menu.speed.120=120 MHz (standard)
duinopeak_pyportal_m4.menu.speed.120.build.f_cpu=120000000L
duinopeak_pyportal_m4.menu.speed.150=150 MHz (overclock)
duinopeak_pyportal_m4.menu.speed.150.build.f_cpu=150000000L
duinopeak_pyportal_m4.menu.speed.180=180 MHz (overclock)
duinopeak_pyportal_m4.menu.speed.180.build.f_cpu=180000000L
duinopeak_pyportal_m4.menu.speed.200=200 MHz (overclock)
duinopeak_pyportal_m4.menu.speed.200.build.f_cpu=200000000L
duinopeak_pyportal_m4.menu.opt.small=Small (-Os) (standard)
duinopeak_pyportal_m4.menu.opt.small.build.flags.optimize=-Os
duinopeak_pyportal_m4.menu.opt.fast=Fast (-O2)
duinopeak_pyportal_m4.menu.opt.fast.build.flags.optimize=-O2
duinopeak_pyportal_m4.menu.opt.faster=Faster (-O3)
duinopeak_pyportal_m4.menu.opt.faster.build.flags.optimize=-O3
duinopeak_pyportal_m4.menu.opt.fastest=Fastest (-Ofast)
duinopeak_pyportal_m4.menu.opt.fastest.build.flags.optimize=-Ofast
duinopeak_pyportal_m4.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
duinopeak_pyportal_m4.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
duinopeak_pyportal_m4.menu.maxqspi.50=50 MHz (standard)
duinopeak_pyportal_m4.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
duinopeak_pyportal_m4.menu.maxqspi.fcpu=CPU Speed / 2
duinopeak_pyportal_m4.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
duinopeak_pyportal_m4.menu.usbstack.arduino=Arduino
duinopeak_pyportal_m4.menu.usbstack.tinyusb=TinyUSB
duinopeak_pyportal_m4.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
duinopeak_pyportal_m4.menu.debug.off=Off
duinopeak_pyportal_m4.menu.debug.on=On
duinopeak_pyportal_m4.menu.debug.on.build.flags.debug=-g

# Duinopeak pyBadge M4 (SAMD51)
# ------------------------------
duinopeak_pybadge_m4.name=Duinopeak pyBadge M4 Express (SAMD51)
duinopeak_pybadge_m4.vid.0=0x239A
duinopeak_pybadge_m4.pid.0=0x8033
duinopeak_pybadge_m4.vid.1=0x239A
duinopeak_pybadge_m4.pid.1=0x0033
duinopeak_pybadge_m4.vid.1=0x239A
duinopeak_pybadge_m4.pid.1=0x8033
duinopeak_pybadge_m4.upload.tool=bossac18
duinopeak_pybadge_m4.upload.protocol=sam-ba
duinopeak_pybadge_m4.upload.maximum_size=507904
duinopeak_pybadge_m4.upload.offset=0x4000
duinopeak_pybadge_m4.upload.use_1200bps_touch=true
duinopeak_pybadge_m4.upload.wait_for_upload_port=true
duinopeak_pybadge_m4.upload.native_usb=true
duinopeak_pybadge_m4.build.mcu=cortex-m4
#duinopeak_pybadge_m4.build.f_cpu=120000000L
duinopeak_pybadge_m4.build.usb_product="Duinopeak pyBadge M4"
duinopeak_pybadge_m4.build.usb_manufacturer="Duinopeak LLC"
duinopeak_pybadge_m4.build.board=PYBADGE_M4
duinopeak_pybadge_m4.build.core=arduino
duinopeak_pybadge_m4.build.extra_flags=-D__SAMD51J19A__ -DDUINOPEAK_PYBADGE_M4_EXPRESS -DCRYSTALLESS -D__SAMD51__ {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
duinopeak_pybadge_m4.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
duinopeak_pybadge_m4.build.openocdscript=openocd_scripts/arduino_zero.cfg
duinopeak_pybadge_m4.build.variant=pybadge_m4
duinopeak_pybadge_m4.build.variant_system_lib=
duinopeak_pybadge_m4.build.vid=0x239A
duinopeak_pybadge_m4.build.pid=0x8033
duinopeak_pybadge_m4.bootloader.tool=openocd
duinopeak_pybadge_m4.bootloader.file=boneduino_pygamer_m4_lc/bootloader-boneduino_pygamer_m4_lc-3.11.0-18-g5301af7-dirty.bin
duinopeak_pybadge_m4.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16
duinopeak_pybadge_m4.menu.cache.on=Enabled
duinopeak_pybadge_m4.menu.cache.on.build.cache_flags=-DENABLE_CACHE
duinopeak_pybadge_m4.menu.cache.off=Disabled
duinopeak_pybadge_m4.menu.cache.off.build.cache_flags=
duinopeak_pybadge_m4.menu.speed.120=120 MHz (standard)
duinopeak_pybadge_m4.menu.speed.120.build.f_cpu=120000000L
duinopeak_pybadge_m4.menu.speed.150=150 MHz (overclock)
duinopeak_pybadge_m4.menu.speed.150.build.f_cpu=150000000L
duinopeak_pybadge_m4.menu.speed.180=180 MHz (overclock)
duinopeak_pybadge_m4.menu.speed.180.build.f_cpu=180000000L
duinopeak_pybadge_m4.menu.speed.200=200 MHz (overclock)
duinopeak_pybadge_m4.menu.speed.200.build.f_cpu=200000000L
duinopeak_pybadge_m4.menu.opt.small=Small (-Os) (standard)
duinopeak_pybadge_m4.menu.opt.small.build.flags.optimize=-Os
duinopeak_pybadge_m4.menu.opt.fast=Fast (-O2)
duinopeak_pybadge_m4.menu.opt.fast.build.flags.optimize=-O2
duinopeak_pybadge_m4.menu.opt.faster=Faster (-O3)
duinopeak_pybadge_m4.menu.opt.faster.build.flags.optimize=-O3
duinopeak_pybadge_m4.menu.opt.fastest=Fastest (-Ofast)
duinopeak_pybadge_m4.menu.opt.fastest.build.flags.optimize=-Ofast
duinopeak_pybadge_m4.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
duinopeak_pybadge_m4.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
duinopeak_pybadge_m4.menu.maxqspi.50=50 MHz (standard)
duinopeak_pybadge_m4.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
duinopeak_pybadge_m4.menu.maxqspi.fcpu=CPU Speed / 2
duinopeak_pybadge_m4.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
duinopeak_pybadge_m4.menu.usbstack.arduino=Arduino
duinopeak_pybadge_m4.menu.usbstack.tinyusb=TinyUSB
duinopeak_pybadge_m4.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
duinopeak_pybadge_m4.menu.debug.off=Off
duinopeak_pybadge_m4.menu.debug.on=On
duinopeak_pybadge_m4.menu.debug.on.build.flags.debug=-g

