duinopeak/ArduinoCore-samd/boards.txt
# Duinopeak pyGamer M4 Express (SAMD51)
# ------------------------------
duinopeak_pygamer_m4.name=Duinopeak PyGamer M4 Express (SAMD51)
duinopeak_pygamer_m4.vid.0=0x239A
duinopeak_pygamer_m4.pid.0=0x803D
duinopeak_pygamer_m4.vid.1=0x239A
duinopeak_pygamer_m4.pid.1=0x003D
duinopeak_pygamer_m4.vid.1=0x239A
duinopeak_pygamer_m4.pid.1=0x803E
duinopeak_pygamer_m4.upload.tool=bossac18
duinopeak_pygamer_m4.upload.protocol=sam-ba
duinopeak_pygamer_m4.upload.maximum_size=507904
duinopeak_pygamer_m4.upload.offset=0x4000
duinopeak_pygamer_m4.upload.use_1200bps_touch=true
duinopeak_pygamer_m4.upload.wait_for_upload_port=true
duinopeak_pygamer_m4.upload.native_usb=true
duinopeak_pygamer_m4.build.mcu=cortex-m4
#duinopeak_pygamer_m4.build.f_cpu=120000000L
duinopeak_pygamer_m4.build.usb_product="Duinopeak PyGamer M4"
duinopeak_pygamer_m4.build.usb_manufacturer="Duinopeak LLC"
duinopeak_pygamer_m4.build.board=PYGAMER_M4
duinopeak_pygamer_m4.build.core=arduino
duinopeak_pygamer_m4.build.extra_flags=-D__SAMD51J19A__ -DDUINOPEAK_PYGAMER_M4_EXPRESS -DCRYSTALLESS -D__SAMD51__ {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
duinopeak_pygamer_m4.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
duinopeak_pygamer_m4.build.openocdscript=openocd_scripts/arduino_zero.cfg
duinopeak_pygamer_m4.build.variant=pygamer_m4
duinopeak_pygamer_m4.build.variant_system_lib=
duinopeak_pygamer_m4.build.vid=0x239A
duinopeak_pygamer_m4.build.pid=0x803D
duinopeak_pygamer_m4.bootloader.tool=openocd
duinopeak_pygamer_m4.bootloader.file=boneduino_pygamer_m4_lc/bootloader-boneduino_pygamer_m4-3.11.0-18-g5301af7-dirty.bin
duinopeak_pygamer_m4.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16
duinopeak_pygamer_m4.menu.cache.on=Enabled
duinopeak_pygamer_m4.menu.cache.on.build.cache_flags=-DENABLE_CACHE
duinopeak_pygamer_m4.menu.cache.off=Disabled
duinopeak_pygamer_m4.menu.cache.off.build.cache_flags=
duinopeak_pygamer_m4.menu.speed.120=120 MHz (standard)
duinopeak_pygamer_m4.menu.speed.120.build.f_cpu=120000000L
duinopeak_pygamer_m4.menu.speed.150=150 MHz (overclock)
duinopeak_pygamer_m4.menu.speed.150.build.f_cpu=150000000L
duinopeak_pygamer_m4.menu.speed.180=180 MHz (overclock)
duinopeak_pygamer_m4.menu.speed.180.build.f_cpu=180000000L
duinopeak_pygamer_m4.menu.speed.200=200 MHz (overclock)
duinopeak_pygamer_m4.menu.speed.200.build.f_cpu=200000000L
duinopeak_pygamer_m4.menu.opt.small=Small (-Os) (standard)
duinopeak_pygamer_m4.menu.opt.small.build.flags.optimize=-Os
duinopeak_pygamer_m4.menu.opt.fast=Fast (-O2)
duinopeak_pygamer_m4.menu.opt.fast.build.flags.optimize=-O2
duinopeak_pygamer_m4.menu.opt.faster=Faster (-O3)
duinopeak_pygamer_m4.menu.opt.faster.build.flags.optimize=-O3
duinopeak_pygamer_m4.menu.opt.fastest=Fastest (-Ofast)
duinopeak_pygamer_m4.menu.opt.fastest.build.flags.optimize=-Ofast
duinopeak_pygamer_m4.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
duinopeak_pygamer_m4.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
duinopeak_pygamer_m4.menu.maxqspi.50=50 MHz (standard)
duinopeak_pygamer_m4.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
duinopeak_pygamer_m4.menu.maxqspi.fcpu=CPU Speed / 2
duinopeak_pygamer_m4.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
duinopeak_pygamer_m4.menu.usbstack.arduino=Arduino
duinopeak_pygamer_m4.menu.usbstack.tinyusb=TinyUSB
duinopeak_pygamer_m4.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
duinopeak_pygamer_m4.menu.debug.off=Off
duinopeak_pygamer_m4.menu.debug.on=On
duinopeak_pygamer_m4.menu.debug.on.build.flags.debug=-g

# Duinopeak pyGamer Advance M4 Express (SAMD51)
# ------------------------------
duinopeak_pygamer_advance_m4.name=Duinopeak PyGamer Advance M4 (SAMD51)
duinopeak_pygamer_advance_m4.vid.0=0x239A
duinopeak_pygamer_advance_m4.pid.0=0x8041
duinopeak_pygamer_advance_m4.vid.1=0x239A
duinopeak_pygamer_advance_m4.pid.1=0x0041
duinopeak_pygamer_advance_m4.vid.1=0x239A
duinopeak_pygamer_advance_m4.pid.1=0x8042
duinopeak_pygamer_advance_m4.upload.tool=bossac18
duinopeak_pygamer_advance_m4.upload.protocol=sam-ba
duinopeak_pygamer_advance_m4.upload.maximum_size=1032192
duinopeak_pygamer_advance_m4.upload.offset=0x4000
duinopeak_pygamer_advance_m4.upload.use_1200bps_touch=true
duinopeak_pygamer_advance_m4.upload.wait_for_upload_port=true
duinopeak_pygamer_advance_m4.upload.native_usb=true
duinopeak_pygamer_advance_m4.build.mcu=cortex-m4
duinopeak_pygamer_advance_m4.build.usb_product="Duinopeak PyGamer Advance M4"
duinopeak_pygamer_advance_m4.build.usb_manufacturer="Duinopeak LLC"
duinopeak_pygamer_advance_m4.build.board=PYGAMER_ADVANCE_M4
duinopeak_pygamer_advance_m4.build.core=arduino
duinopeak_pygamer_advance_m4.build.extra_flags=-D__SAMD51J20A__ -DDUINOPEAK_PYGAMER_ADVANCE_M4_EXPRESS -DCRYSTALLESS -D__SAMD51__ {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
duinopeak_pygamer_advance_m4.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
duinopeak_pygamer_advance_m4.build.openocdscript=openocd_scripts/arduino_zero.cfg
duinopeak_pygamer_advance_m4.build.variant=pygamer_advance_m4
duinopeak_pygamer_advance_m4.build.variant_system_lib=
duinopeak_pygamer_advance_m4.build.vid=0x239A
duinopeak_pygamer_advance_m4.build.pid=0x8041
duinopeak_pygamer_advance_m4.bootloader.tool=openocd
duinopeak_pygamer_advance_m4.bootloader.file=boneduino_pygamer_m4/bootloader-boneduino_m4-v2.0.0-duinopeak.5.bin
duinopeak_pygamer_advance_m4.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16
duinopeak_pygamer_advance_m4.menu.cache.on=Enabled
duinopeak_pygamer_advance_m4.menu.cache.on.build.cache_flags=-DENABLE_CACHE
duinopeak_pygamer_advance_m4.menu.cache.off=Disabled
duinopeak_pygamer_advance_m4.menu.cache.off.build.cache_flags=
duinopeak_pygamer_advance_m4.menu.speed.120=120 MHz (standard)
duinopeak_pygamer_advance_m4.menu.speed.120.build.f_cpu=120000000L
duinopeak_pygamer_advance_m4.menu.speed.150=150 MHz (overclock)
duinopeak_pygamer_advance_m4.menu.speed.150.build.f_cpu=150000000L
duinopeak_pygamer_advance_m4.menu.speed.180=180 MHz (overclock)
duinopeak_pygamer_advance_m4.menu.speed.180.build.f_cpu=180000000L
duinopeak_pygamer_advance_m4.menu.speed.200=200 MHz (overclock)
duinopeak_pygamer_advance_m4.menu.speed.200.build.f_cpu=200000000L
duinopeak_pygamer_advance_m4.menu.opt.small=Small (-Os) (standard)
duinopeak_pygamer_advance_m4.menu.opt.small.build.flags.optimize=-Os
duinopeak_pygamer_advance_m4.menu.opt.fast=Fast (-O2)
duinopeak_pygamer_advance_m4.menu.opt.fast.build.flags.optimize=-O2
duinopeak_pygamer_advance_m4.menu.opt.faster=Faster (-O3)
duinopeak_pygamer_advance_m4.menu.opt.faster.build.flags.optimize=-O3
duinopeak_pygamer_advance_m4.menu.opt.fastest=Fastest (-Ofast)
duinopeak_pygamer_advance_m4.menu.opt.fastest.build.flags.optimize=-Ofast
duinopeak_pygamer_advance_m4.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
duinopeak_pygamer_advance_m4.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
duinopeak_pygamer_advance_m4.menu.maxqspi.50=50 MHz (standard)
duinopeak_pygamer_advance_m4.menu.maxqspi.fcpu=CPU Speed / 2
duinopeak_pygamer_advance_m4.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
duinopeak_pygamer_advance_m4.menu.maxqspi.fcpu=CPU Speed / 2
duinopeak_pygamer_advance_m4.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
duinopeak_pygamer_advance_m4.menu.usbstack.arduino=Arduino
duinopeak_pygamer_advance_m4.menu.usbstack.tinyusb=TinyUSB
duinopeak_pygamer_advance_m4.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
duinopeak_pygamer_advance_m4.menu.debug.off=Off
duinopeak_pygamer_advance_m4.menu.debug.on=On
duinopeak_pygamer_advance_m4.menu.debug.on.build.flags.debug=-g

# Duinopeak MONSTER M4SK Express (SAMD51)
# ------------------------------
duinopeak_monster_m4sk.name=Duinopeak MONSTER M4SK (SAMD51)
duinopeak_monster_m4sk.vid.0=0x239A
duinopeak_monster_m4sk.pid.0=0x8047
duinopeak_monster_m4sk.vid.1=0x239A
duinopeak_monster_m4sk.pid.1=0x0047
duinopeak_monster_m4sk.vid.1=0x239A
duinopeak_monster_m4sk.pid.1=0x8048
duinopeak_monster_m4sk.upload.tool=bossac18
duinopeak_monster_m4sk.upload.protocol=sam-ba
duinopeak_monster_m4sk.upload.maximum_size=507904
duinopeak_monster_m4sk.upload.offset=0x4000
duinopeak_monster_m4sk.upload.use_1200bps_touch=true
duinopeak_monster_m4sk.upload.wait_for_upload_port=true
duinopeak_monster_m4sk.upload.native_usb=true
duinopeak_monster_m4sk.build.mcu=cortex-m4
#duinopeak_monster_m4sk.build.f_cpu=120000000L
duinopeak_monster_m4sk.build.usb_product="Duinopeak MONSTER M4SK"
duinopeak_monster_m4sk.build.usb_manufacturer="Duinopeak LLC"
duinopeak_monster_m4sk.build.board=MONSTER_M4SK
duinopeak_monster_m4sk.build.core=arduino
duinopeak_monster_m4sk.build.extra_flags=-D__SAMD51G19A__ -DDUINOPEAK_MONSTER_M4SK_EXPRESS -DCRYSTALLESS -D__SAMD51__ {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
duinopeak_monster_m4sk.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
duinopeak_monster_m4sk.build.openocdscript=openocd_scripts/arduino_zero.cfg
duinopeak_monster_m4sk.build.variant=monster_m4sk
duinopeak_monster_m4sk.build.variant_system_lib=
duinopeak_monster_m4sk.build.vid=0x239A
duinopeak_monster_m4sk.build.pid=0x8047
duinopeak_monster_m4sk.bootloader.tool=openocd
duinopeak_monster_m4sk.bootloader.file=boneduinoM4/bootloader-boneduino_m4-v2.0.0-duinopeak.5.bin
duinopeak_monster_m4sk.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16
duinopeak_monster_m4sk.menu.cache.on=Enabled
duinopeak_monster_m4sk.menu.cache.on.build.cache_flags=-DENABLE_CACHE
duinopeak_monster_m4sk.menu.cache.off=Disabled
duinopeak_monster_m4sk.menu.cache.off.build.cache_flags=
duinopeak_monster_m4sk.menu.speed.120=120 MHz (standard)
duinopeak_monster_m4sk.menu.speed.120.build.f_cpu=120000000L
duinopeak_monster_m4sk.menu.speed.150=150 MHz (overclock)
duinopeak_monster_m4sk.menu.speed.150.build.f_cpu=150000000L
duinopeak_monster_m4sk.menu.speed.180=180 MHz (overclock)
duinopeak_monster_m4sk.menu.speed.180.build.f_cpu=180000000L
duinopeak_monster_m4sk.menu.speed.200=200 MHz (overclock)
duinopeak_monster_m4sk.menu.speed.200.build.f_cpu=200000000L
duinopeak_monster_m4sk.menu.opt.small=Small (-Os) (standard)
duinopeak_monster_m4sk.menu.opt.small.build.flags.optimize=-Os
duinopeak_monster_m4sk.menu.opt.fast=Fast (-O2)
duinopeak_monster_m4sk.menu.opt.fast.build.flags.optimize=-O2
duinopeak_monster_m4sk.menu.opt.faster=Faster (-O3)
duinopeak_monster_m4sk.menu.opt.faster.build.flags.optimize=-O3
duinopeak_monster_m4sk.menu.opt.fastest=Fastest (-Ofast)
duinopeak_monster_m4sk.menu.opt.fastest.build.flags.optimize=-Ofast
duinopeak_monster_m4sk.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
duinopeak_monster_m4sk.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
duinopeak_monster_m4sk.menu.maxqspi.50=50 MHz (standard)
duinopeak_monster_m4sk.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
duinopeak_monster_m4sk.menu.maxqspi.fcpu=CPU Speed / 2
duinopeak_monster_m4sk.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
duinopeak_monster_m4sk.menu.usbstack.arduino=Arduino
duinopeak_monster_m4sk.menu.usbstack.tinyusb=TinyUSB
duinopeak_monster_m4sk.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
duinopeak_monster_m4sk.menu.debug.off=Off
duinopeak_monster_m4sk.menu.debug.on=On
duinopeak_monster_m4sk.menu.debug.on.build.flags.debug=-g

# Duinopeak Hallowing M4 Express (SAMD51)
# ------------------------------
duinopeak_hallowing_m4.name=Duinopeak Hallowing M4 (SAMD51)
duinopeak_hallowing_m4.vid.0=0x239A
duinopeak_hallowing_m4.pid.0=0x8049
duinopeak_hallowing_m4.vid.1=0x239A
duinopeak_hallowing_m4.pid.1=0x0049
duinopeak_hallowing_m4.vid.1=0x239A
duinopeak_hallowing_m4.pid.1=0x804A
duinopeak_hallowing_m4.upload.tool=bossac18
duinopeak_hallowing_m4.upload.protocol=sam-ba
duinopeak_hallowing_m4.upload.maximum_size=507904
duinopeak_hallowing_m4.upload.offset=0x4000
duinopeak_hallowing_m4.upload.use_1200bps_touch=true
duinopeak_hallowing_m4.upload.wait_for_upload_port=true
duinopeak_hallowing_m4.upload.native_usb=true
duinopeak_hallowing_m4.build.mcu=cortex-m4
#duinopeak_hallowing_m4.build.f_cpu=120000000L
duinopeak_hallowing_m4.build.usb_product="Duinopeak Hallowing M4"
duinopeak_hallowing_m4.build.usb_manufacturer="Duinopeak LLC"
duinopeak_hallowing_m4.build.board=HALLOWING_M4
duinopeak_hallowing_m4.build.core=arduino
duinopeak_hallowing_m4.build.extra_flags=-D__SAMD51J19A__ -DDUINOPEAK_HALLOWING_M4_EXPRESS -DCRYSTALLESS -D__SAMD51__ {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
duinopeak_hallowing_m4.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
duinopeak_hallowing_m4.build.openocdscript=openocd_scripts/arduino_zero.cfg
duinopeak_hallowing_m4.build.variant=hallowing_m4
duinopeak_hallowing_m4.build.variant_system_lib=
duinopeak_hallowing_m4.build.vid=0x239A
duinopeak_hallowing_m4.build.pid=0x8049
duinopeak_hallowing_m4.bootloader.tool=openocd
duinopeak_hallowing_m4.bootloader.file=boneduino_m4_express/bootloader-boneduino_m4-v2.0.0-duinopeak.5.bin
duinopeak_hallowing_m4.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16
duinopeak_hallowing_m4.menu.cache.on=Enabled
duinopeak_hallowing_m4.menu.cache.on.build.cache_flags=-DENABLE_CACHE
duinopeak_hallowing_m4.menu.cache.off=Disabled
duinopeak_hallowing_m4.menu.cache.off.build.cache_flags=
duinopeak_hallowing_m4.menu.speed.120=120 MHz (standard)
duinopeak_hallowing_m4.menu.speed.120.build.f_cpu=120000000L
duinopeak_hallowing_m4.menu.speed.150=150 MHz (overclock)
duinopeak_hallowing_m4.menu.speed.150.build.f_cpu=150000000L
duinopeak_hallowing_m4.menu.speed.180=180 MHz (overclock)
duinopeak_hallowing_m4.menu.speed.180.build.f_cpu=180000000L
duinopeak_hallowing_m4.menu.speed.200=200 MHz (overclock)
duinopeak_hallowing_m4.menu.speed.200.build.f_cpu=200000000L
duinopeak_hallowing_m4.menu.opt.small=Small (-Os) (standard)
duinopeak_hallowing_m4.menu.opt.small.build.flags.optimize=-Os
duinopeak_hallowing_m4.menu.opt.fast=Fast (-O2)
duinopeak_hallowing_m4.menu.opt.fast.build.flags.optimize=-O2
duinopeak_hallowing_m4.menu.opt.faster=Faster (-O3)
duinopeak_hallowing_m4.menu.opt.faster.build.flags.optimize=-O3
duinopeak_hallowing_m4.menu.opt.fastest=Fastest (-Ofast)
duinopeak_hallowing_m4.menu.opt.fastest.build.flags.optimize=-Ofast
duinopeak_hallowing_m4.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
duinopeak_hallowing_m4.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
duinopeak_hallowing_m4.menu.maxqspi.50=50 MHz (standard)
duinopeak_hallowing_m4.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
duinopeak_hallowing_m4.menu.maxqspi.fcpu=CPU Speed / 2
duinopeak_hallowing_m4.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
duinopeak_hallowing_m4.menu.usbstack.arduino=Arduino
duinopeak_hallowing_m4.menu.usbstack.tinyusb=TinyUSB
duinopeak_hallowing_m4.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
duinopeak_hallowing_m4.menu.debug.off=Off
duinopeak_hallowing_m4.menu.debug.on=On
duinopeak_hallowing_m4.menu.debug.on.build.flags.debug=-g

