duinopeak/ArduinoCore-samd/boards.txt
# Duinopeak Matrix Portal M4 (SAMD51)
# ------------------------------
duinopeak_matrixportal_m4.name=Duinopeak Matrix Portal M4 (SAMD51)
duinopeak_matrixportal_m4.vid.0=0x239A
duinopeak_matrixportal_m4.pid.0=0x80C9
duinopeak_matrixportal_m4.vid.1=0x239A
duinopeak_matrixportal_m4.pid.1=0x00C9
duinopeak_matrixportal_m4.vid.1=0x239A
duinopeak_matrixportal_m4.pid.1=0x80CA
duinopeak_matrixportal_m4.upload.tool=bossac18
duinopeak_matrixportal_m4.upload.protocol=sam-ba
duinopeak_matrixportal_m4.upload.maximum_size=507904
duinopeak_matrixportal_m4.upload.offset=0x4000
duinopeak_matrixportal_m4.upload.use_1200bps_touch=true
duinopeak_matrixportal_m4.upload.wait_for_upload_port=true
duinopeak_matrixportal_m4.upload.native_usb=true
duinopeak_matrixportal_m4.build.mcu=cortex-m4
#duinopeak_matrixportal_m4.build.f_cpu=120000000L
duinopeak_matrixportal_m4.build.usb_product="Duinopeak Matrix Portal M4"
duinopeak_matrixportal_m4.build.usb_manufacturer="Duinopeak LLC"
duinopeak_matrixportal_m4.build.board=MATRIXPORTAL_M4
duinopeak_matrixportal_m4.build.core=arduino
duinopeak_matrixportal_m4.build.extra_flags=-D__SAMD51J19A__ -DDUINOPEAK_MATRIXPORTAL_M4_EXPRESS -DCRYSTALLESS -D__SAMD51__ {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
duinopeak_matrixportal_m4.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
duinopeak_matrixportal_m4.build.openocdscript=openocd_scripts/arduino_zero.cfg
duinopeak_matrixportal_m4.build.variant=matrixportal_m4
duinopeak_matrixportal_m4.build.variant_system_lib=
duinopeak_matrixportal_m4.build.vid=0x239A
duinopeak_matrixportal_m4.build.pid=0x80C9
duinopeak_matrixportal_m4.bootloader.tool=openocd
duinopeak_matrixportal_m4.bootloader.file=matrixportalM4/bootloader-matrixportal_m4.bin
duinopeak_matrixportal_m4.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16
duinopeak_matrixportal_m4.menu.cache.on=Enabled
duinopeak_matrixportal_m4.menu.cache.on.build.cache_flags=-DENABLE_CACHE
duinopeak_matrixportal_m4.menu.cache.off=Disabled
duinopeak_matrixportal_m4.menu.cache.off.build.cache_flags=
duinopeak_matrixportal_m4.menu.speed.120=120 MHz (standard)
duinopeak_matrixportal_m4.menu.speed.120.build.f_cpu=120000000L
duinopeak_matrixportal_m4.menu.speed.150=150 MHz (overclock)
duinopeak_matrixportal_m4.menu.speed.150.build.f_cpu=150000000L
duinopeak_matrixportal_m4.menu.speed.180=180 MHz (overclock)
duinopeak_matrixportal_m4.menu.speed.180.build.f_cpu=180000000L
duinopeak_matrixportal_m4.menu.speed.200=200 MHz (overclock)
duinopeak_matrixportal_m4.menu.speed.200.build.f_cpu=200000000L
duinopeak_matrixportal_m4.menu.opt.small=Small (-Os) (standard)
duinopeak_matrixportal_m4.menu.opt.small.build.flags.optimize=-Os
duinopeak_matrixportal_m4.menu.opt.fast=Fast (-O2)
duinopeak_matrixportal_m4.menu.opt.fast.build.flags.optimize=-O2
duinopeak_matrixportal_m4.menu.opt.faster=Faster (-O3)
duinopeak_matrixportal_m4.menu.opt.faster.build.flags.optimize=-O3
duinopeak_matrixportal_m4.menu.opt.fastest=Fastest (-Ofast)
duinopeak_matrixportal_m4.menu.opt.fastest.build.flags.optimize=-Ofast
duinopeak_matrixportal_m4.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
duinopeak_matrixportal_m4.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
duinopeak_matrixportal_m4.menu.maxqspi.50=50 MHz (standard)
duinopeak_matrixportal_m4.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
duinopeak_matrixportal_m4.menu.maxqspi.fcpu=CPU Speed / 2
duinopeak_matrixportal_m4.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
duinopeak_matrixportal_m4.menu.usbstack.arduino=Arduino
duinopeak_matrixportal_m4.menu.usbstack.tinyusb=TinyUSB
duinopeak_matrixportal_m4.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
duinopeak_matrixportal_m4.menu.debug.off=Off
duinopeak_matrixportal_m4.menu.debug.on=On
duinopeak_matrixportal_m4.menu.debug.on.build.flags.debug=-g